In [8]:
import pandas as pd

In [9]:
df = pd.DataFrame(
    {'name': ['Alice', 'Bob', 'Carol', 'Dave', 'Eve'],
    'age': [21, 22, 23, 24, 25],
    'city': ['Chicago', 'New York', 'Washington', 'Los Angeles', 'San Francisco']}
)
df

    name  age           city
0  Alice   21        Chicago
1    Bob   22       New York
2  Carol   23     Washington
3   Dave   24    Los Angeles
4    Eve   25  San Francisco

In [18]:
data = [['Alice', 'Bob', 'Carol', 'Dave', 'Eve'],
     [21, 22, 23, 24, 25],
    ['Chicago', 'New York', 'Washington', 'Los Angeles', 'San Francisco']]
column = ['1', '2', '3', '4', '5']

In [19]:
data = pd.DataFrame(data=data, columns=column)
data

         1         2           3            4              5
0    Alice       Bob       Carol         Dave            Eve
1       21        22          23           24             25
2  Chicago  New York  Washington  Los Angeles  San Francisco